Revit 2027 API
Viewport.GetProjectionToSheetTransform Method
 Returns the transform from the view's projection space to the sheet space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetProjectionToSheetTransform()
Public Function GetProjectionToSheetTransform As Transform
public:
Transform^ GetProjectionToSheetTransform()
member GetProjectionToSheetTransform : unit -> Transform
Return Value
Transform
 The transform from the view's projection space to the sheet space.
Exceptions
Exception | Condition
InvalidOperationException |  The viewport is not on a sheet. -or- The viewport does not have transforms.
Remarks
 This transform accounts for the position and rotation of a viewport on a sheet.
 The transforms from the model space to the view projection space are returned by [!:View.GetModelToProjectionTransforms()].
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace